Documents/РаспределениеЧистойПрибыли.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РаспределениеЧистойПрибыли</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Типовой</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПрибыли</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДивидендов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДивидендов1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетРезервов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыИзмененийВСобственномКапитале.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыИзмененийВСобственномКапитале</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИзмененияУчетнойПолитики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереоценкаОсновныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КурсовыеРазницыЗарубежныхПодразделений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходУбытокЗаПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дивиденды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭмиссияАкций</Name>
					<Comment>Выпуск собственных долевых инструментов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХеджированиеДенежныхПотоков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыкупленныеСобственныеДолевыеИнструменты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходУбытокНеПризнанныйВОтчетеОДоходахИРасходахУдалить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеУбыткаУдалить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеИнвестицийУдалить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводАмортизацииОтПереоценкиОсновныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереоценкаФинансовыхАктивовИмеющихсяВНаличииДляПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоляВПрочейСовокупнойПрибылиУбыткеАссоциированныхОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктуарныеПрибылиУбыткиПоПенсионнымОбязательствам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭффектИзмененияВСтавкеПодоходногоНалогаНаОтсроченныйНалогДочернихОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХеджированиеЧистыхИнвестицийВЗарубежныеОперации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВознаграждениеРаботниковАкциями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносыСобственников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпускСобственныхДолевыхИнструментовСвязанныхСОбъединениемБизнеса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолевойКомпонентКонвертируемыхИнструментов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРаспределенияВПользуСобственников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеОперацииССобственниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененияВДолеУчастияВДочернихОрганизацияхНеПриводящиеКПотереКонтроля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеОперации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереоценкаДолговыхФинансовыхИнструментовОцениваемыхПоСправедливойСтоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереоценкаДолевыхФинансовыхИнструментовОцениваемыхПоСправедливойСтоимости</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РаспределениеЧистойПрибыли/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если СуммаПрибыли < 0 Тогда
		Отказ = Истина;
		Сообщить("Сумма прибыли за период отрицательная!");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СчетРезервов) Тогда
		Отказ = Истина;
		Сообщить("Не выбран счет резервов!");		
	КонецЕсли;
		
	Если Не Отказ Тогда 
		
		РегВалюта = Константы.ВалютаРегламентированногоУчета.Получить();
		
		// регистр Типовой 
		Движения.Типовой.Записывать = Истина;
		Движения.Типовой.Очистить();
		Движение = Движения.Типовой.Добавить();
		Движение.СчетДт = ПланыСчетов.Типовой.НераспределеннаяПрибыльНепокрытыйУбытокПредыдущихЛет;
		Движение.СчетКт = ПланыСчетов.Типовой.КраткосрочнаяКредиторскаяЗадолженностьПоДивидендамИДоходамУчастников;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Сумма = СуммаДивидендов;
		Если Движение.СчетКт.Валютный Тогда
			Движение.ВалютаКт = РегВалюта;
			Движение.ВалютнаяСуммаКт = СуммаДивидендов;
		КонецЕсли;
		Движение.Содержание = Содержание;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоТиповые.Контрагенты] = Контрагент;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоТиповые.Договоры] = Договор;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоТиповые.ТипыОпераций] = ТипОперации;
						
		// регистр Типовой 
		Движение = Движения.Типовой.Добавить();
		Движение.СчетДт = ПланыСчетов.Типовой.НераспределеннаяПрибыльНепокрытыйУбытокПредыдущихЛет;
		Движение.СчетКт = СчетРезервов;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Сумма = СуммаПрибыли - СуммаДивидендов;
		Если Движение.СчетКт.Валютный Тогда
			Движение.ВалютаКт = РегВалюта;
			Движение.ВалютнаяСуммаКт = СуммаПрибыли - СуммаДивидендов;
		КонецЕсли;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоТиповые.ВидыИзмененийВСобственномКапитале] = Перечисления.ВидыИзмененийВСобственномКапитале.ДоходУбытокЗаПериод;
		Движение.Содержание = Договор;
		
	КонецЕсли;
	
КонецПроцедуры
